package Day11;

public class Day11_5 {
	
//	도서 검색 프로그램
//	1.조건 : 도서목록 배열 선언 
//		[ 4개의 도서를 배열에 등록 ]
//		1. 된다! 네이버 블로그&포스트
//		2. 스프링 부트 실전 활용 마스터
//		3. Tucker의 Go 언어 프로그래밍
//		4. 혼자 공부하는 C 언어
//
//	2. Scanner -> System.in.read()
//
//	3.검색기능 : 검색을 입력받아 검색한 단어가 포함된 도서를 모두 출력
//	4.수정기능 : 수정할 도서를 입력받아 선택후 교체할 단어와 새로운 단어 입력받아 교체
//	
//	String[] 도서목록 = {	
//			"된다! 네이버 블로그&포스트",
//			"스프링 부트 실전 활용 마스터",
//			"Tucker의 Go 언어 프로그래밍",
//			"혼자 공부하는 C 언어"
//	};
	public static void main(String[] args) {
		
		
	}
}
