package Day05;

public class Day05_4_Board {
	// 문제1: 게시판 프로그램  
		// 0. 2차원 배열 사용  // 게시물번호는 인덱스 번호
		// 1. 게시판 [ 제목 , 내용 , 작성자 , 작성일[Date] , 조회수 ]
	
		// 2. 메인 메뉴 예시
		// 
		/*
		 * 			[ 게시판 ]
		 * 	순번	제목			작성자	작성일	조회수 
		 * 	1   안녕			김현수	10-05	3 
		 * 	2  	안녕2		김현수	10-05	3 
		 * 	3	안녕3		강호동	10-04	2
		 * 	선택 : 1.글쓰기 2.글상세페이지	
		 */
	
		// [ 글쓰기 했을때 ]
			// 1. 제목 , 내용 , 작성자 , 작성일[Date] 입력받아 배열에 저장 
		// [ 글상세페이지 눌렀을때 ] 
			// 1. 상세페이지를 볼 게시물 번호 선택 
			// 2. 선택한 게시물의 상페이지 출력 
	
		// 2. 상세페이지 예시 
		/*
		 *	>> 제목 : 안녕  
		 *	>> 작성자 : 김현수 	작성일 : 10-5		조회수 : 3
		 * 	>> 내용 : 안녕하세요 자바 입니다 
		 * 	
		 * 	>> 선택 : 1. 뒤로가기	
		 * 
		 */
}
