package Day02;

public class Day02_4 {
	
	// 문제1 : 급여 명세서 
	/*
	 * [조건] 입력받기 : 기본급 , 수당 
	 * [출력] 실수령액 = 기본급 + 수당 - 세금[ 기본급10% ]
	 * 
	 */
	
	// 문제2 : 지폐 개수 세기 
	/*
	 * [조건] : 십만원 단위의 금액을 입렫받아 
	 * [출력] : 입력받은 금액의 지폐수 세기 
	 * [출력 예 ] : 356789  
	 * 		십만원 : 3장 
	 *		만원 : 5장 
	 * 		천원 : 6장 
	 * 		백원 : 7개
	 */
	
	//문제3 : 하나의 정수를 입력받아 7의 배수인지 출력[ true , false ]
	
	//문제4 : 하나의 정수를 입력받아 홀수 인지 확인 [ true , false ]
	
	//문제5 : 하나의 정수를 입력받아 7의 배수 이면서 짝수 인지 확인 [ true , false ]

	//문제6 : 두개의 정수를 입력받아 더 큰지 출력  [ true , false ]
	
	//문제7 : 반지름을 입력받아 원 넓이 출력하기 
		// 원 넓이 공식 => 반지름 * 반지름 * 원주율[3.14]
	
	//문제8 : 두 실수를 입력받아 앞실수의 값이 뒤의 값의 몇% 인지 출력하기
		// 예) 54.5   84.3 이면    64.285714%
	
	
	
	
	
	
	
	
	
	
	

}
